class Patient:
    def __init__(self, id, Фамилия, Имя, Отчество, Адрес, Телефон, Номер_медкарты, Диагноз):
        self.id = int(id)
        self.Фамилия = Фамилия
        self.Имя = Имя
        self.Отчество = Отчество
        self.Адрес = Адрес
        self.Телефон = Телефон
        self.Номер_медкарты = Номер_медкарты
        self.Диагноз = Диагноз

# Создаем список пациентов
patients = [
    Patient("1", "Иванов", "Иван", "Иванович", "Адрес1", "1234567890", "MC001", "Грипп"),
    Patient("2", "Петрова", "Анна", "Сергеевна", "Адрес2", "0987654321", "MC002", "Диабет"),
    Patient("3", "Сидоров", "Сидр", "Сидорович", "Адрес3", "5555555555", "MC003", "Грипп"),
    Patient("4", "Иванова", "Мария", "Ивановна", "Адрес4", "2222222222", "MC004", "Гипертония")
]

# Пример функции для поиска пациентов с определенным диагнозом
def patients_with_diagnosis(diagnosis):
    return [patient for patient in patients if patient.Диагноз == diagnosis]

# Пример функции для поиска пациентов с номерами медкарт в диапазоне
def patients_in_card_range(start, end):
    return [patient for patient in patients if start <= patient.Номер_медкарты <= end]

# Вывод пациентов с диагнозом "Грипп"
print("Пациенты с диагнозом 'Грипп':")
for p in patients_with_diagnosis("Грипп"):
    print(vars(p))

# Вывод пациентов с номерами медкарт в диапазоне от "MC001" до "MC003"
print("\nПациенты с номерами медкарт в диапазоне от MC001 до MC003:")
for p in patients_in_card_range("MC001", "MC003"):
    print(vars(p))